Autodesk.Revit.DB.Visual.PlasticVinyl.CommonTintColor
The property labeled "Tint Color" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.CommonTintToggle
The property labeled "Tint" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylPatternAmount
The property labeled "Amount" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 2".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylPatternMap
The property labeled "Image" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylPattern
The property labeled "Relief Pattern" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylPatternType".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylBumpAmount
The property labeled "Amount" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylBumpMap
The property labeled "Image" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylBump
The property labeled "Finish Bumps" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylBumpType".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylApplication
The property labeled "Finish" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylApplicationType".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylColorByObject
The property labeled "Color By Object" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylColor
The property labeled "Color" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylType
The property labeled "Type" from the "PlasticVinyl" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylType".
Since:
2018.1

Autodesk.Revit.DB.Visual.PlasticVinyl
Represents the properties of materials.
Since:
2018.1